<a href="https://colab.research.google.com/github/sreeniedp/Data-Science-Projects/blob/master/sorted_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv ('MFL_data_sorted.csv', index_col= False)

In [7]:
df=df.iloc[:,1:]

In [16]:
df.head()

      Ct_Date     Day  Ct_Time  GLPLNOS
0  2017-12-11  Monday       10     91.0
1  2017-12-11  Monday       12   1117.0
2  2017-12-11  Monday       14   2708.0
3  2017-12-11  Monday       16   3761.0
4  2017-12-11  Monday       18   4591.0

In [17]:
df_gp=df.groupby(['Ct_Date'	,'Day',	'Ct_Time']).sum()

In [21]:
df_gp.tail(10)

                              GLPLNOS
Ct_Date    Day       Ct_Time
2020-12-30 Wednesday 18       28677.0
                     20       28775.0
                     22       28776.0
2020-12-31 Thursday  10         568.0
                     12        7044.0
                     14       15363.0
                     16       22881.0
                     18       27851.0
                     20       27959.0
                     22       27959.0

In [ ]:
pvt = pd.pivot_table(df.reset_index(), index=['index','trans','entity','st', 'fec_id'],
   .....:                      columns='cmte_id', values='amount', aggfunc='sum', fill_value=0) \
   .....:         .reset_index()

In [33]:
df_pvt=pd.pivot_table(df_gp.reset_index(),index=['Ct_Date','Day'],columns='Ct_Time',values='GLPLNOS', aggfunc='sum', fill_value=0)

In [34]:
df_pvt.columns

Int64Index([10, 12, 14, 16, 18, 20, 22], dtype='int64', name='Ct_Time')

In [35]:
df_pvt.head()

Ct_Time                10    12     14     16     18     20  22
Ct_Date    Day
2017-12-11 Monday     754  8211  18047  25007  30213  30323   0
2017-12-12 Tuesday    634  6401  12708  17930  21885  22025   0
2017-12-13 Wednesday  476  6421  13216  18664  22771  22923   0
2017-12-14 Thursday   530  6051  12362  17663  21770  21971   0
2017-12-15 Friday     482  5397  11078  15978  19833  20017   0